class Urls:
    SCOOTER_MAIN = "https://qa-scooter.praktikum-services.ru/"
    DZEN_MAIN = "https://dzen.ru/"

class AnswerTexts:

    HOW_MUCH_ANSWER_TEXT = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    WANT_MORE_SCOOTERS_ANSWER_TEXT = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    TIME_CALCULATION_ANSWER_TEXT = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    ORDER_TODAY_ANSWER_TEXT = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    ORDER_EXTEND_ANSWER_TEXT = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    CHARGE_ANSWER_TEXT = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    ORDER_CANCELLATION_ANSWER_TEXT = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    NOT_IN_MOSCOW_ANSWER_TEXT = "Да, обязательно. Всем самокатов! И Москве, и Московской области."


class OrderData:

    NAME_1 = "Влада"
    NAME_2 = "Ира"

    SURNAME_1 = "Хрусталева"
    SURNAME_2 = "Патрушинская"

    ADDRESS_1 = "Гагаринский пер., 38"
    ADDRESS_2 = "Малый Черкасский пер., 58"

    PHONE_NUMBER_1 = "+74990527507"
    PHONE_NUMBER_2 = "+74997752853"

    COMMENT_1 = "Захватите с собой ещё чипсы"
    COMMENT_2 = "А мне воду без газа"